# DialogType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MessageBoxShowingEventArgs..::..DialogType Property
MessageBoxShowingEventArgs Class See Also
---
An integer that describes the standard Windows type of the dialog box.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public int DialogType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DialogType As Integer
	Get
```

Visual C++
---
```text
public:
property int DialogType {
	int get ();
}
```

# See Also
MessageBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace